In [1]:
import numpy  as np
import pandas as pd

# **Opérations**

In [2]:
notes = pd.DataFrame({
    'Anglais'     : {"Christophe":  1, "Carla":  1, "Caroline": 18, "Jean-Baptiste": 17, "Florence": 17, "Emma": 20},
    'Français'    : {"Christophe":  0, "Carla":  5, "Caroline": 20, "Jean-Baptiste": 12, "Florence": 19, "Emma": 19},
    'Histoire'    : {"Christophe":  0, "Carla":  9, "Caroline": 20, "Jean-Baptiste": 18, "Florence": 20, "Emma": 19},
    'Informatique': {"Christophe":  0, "Carla": 15, "Caroline": 19, "Jean-Baptiste": 17, "Florence": 18, "Emma": 11},
    'Maths'       : {"Christophe": 17, "Carla":  6, "Caroline": 20, "Jean-Baptiste": 12, "Florence": 16, "Emma": 19}
})

# Calcule la moyenne et l'ajoute en dernière colonne
notes['Moyenne'] = notes.mean(axis=1)
notes

               Anglais  Français  Histoire  Informatique  Maths  Moyenne
Christophe           1         0         0             0     17      3.6
Carla                1         5         9            15      6      7.2
Caroline            18        20        20            19     20     19.4
Jean-Baptiste       17        12        18            17     12     15.2
Florence            17        19        20            18     16     18.0
Emma                20        19        19            11     19     17.6

In [3]:
# Les notes de tous en Anglais sans répéter les valeurs identiques `unique()`
notes['Anglais'].unique()

array([ 1, 18, 17, 20])

In [4]:
notes['Anglais']

Christophe        1
Carla             1
Caroline         18
Jean-Baptiste    17
Florence         17
Emma             20
Name: Anglais, dtype: int64

In [5]:
# Combien de valeurs uniques
notes['Anglais'].nunique()

4

In [6]:
# Le carré d'x
def carre(x):
    return x*x

carre(3)

9

In [7]:
# Le carré des notes d'anglais
notes['Anglais'].apply(carre)

Christophe         1
Carla              1
Caroline         324
Jean-Baptiste    289
Florence         289
Emma             400
Name: Anglais, dtype: int64

In [8]:
# Ordonner le tableau selon les notes en français
notes.sort_values('Français')

               Anglais  Français  Histoire  Informatique  Maths  Moyenne
Christophe           1         0         0             0     17      3.6
Carla                1         5         9            15      6      7.2
Jean-Baptiste       17        12        18            17     12     15.2
Florence            17        19        20            18     16     18.0
Emma                20        19        19            11     19     17.6
Caroline            18        20        20            19     20     19.4

In [9]:
# Quelles valeurs sont nules
notes.isnull()

               Anglais  Français  Histoire  Informatique  Maths  Moyenne
Christophe       False     False     False         False  False    False
Carla            False     False     False         False  False    False
Caroline         False     False     False         False  False    False
Jean-Baptiste    False     False     False         False  False    False
Florence         False     False     False         False  False    False
Emma             False     False     False         False  False    False

In [10]:
# Qui a la meillleur note en anglais
notes['Anglais'].idxmax()

'Emma'

In [11]:
# Qui a la plus basse note en histoire
notes['Histoire'].idxmin()

'Christophe'

In [12]:
# La plus basse en anglais
notes['Anglais'].idxmin()

'Christophe'

Carla aussi, mais il ne l'affiche pas

In [13]:
# L'indice du meilleur élève en informatique
notes['Informatique'].argmax()

np.int64(2)

In [14]:
# Le moins bon
notes['Informatique'].argmin()

np.int64(0)